app/Http/Controllers/Auth/LoginController.php

    public function storeSSOUser($response, $username, $password){
        $userIfExsists = User::where('username', $username)->first();
---
select * from `users` where `username` = '110100189' limit 1