app/Http/helpers.php

function getOfficeUser($uid){
    $user = User::find($uid);
---
select * from `users` where `users`.`id` = 1 limit 1