app/Http/Helpers/Notification.php

    public static function get_remainder()
    {
        $reminders = Reminders::where('if_notified', 1)
        ->join('users', 'users.id', '=', 'reminders.user_id')
        ->where('user_id', Auth::user()->id)
        ->select('reminders.*', 'users.nameEn', 'users.nameBn')
        ->latest()
        ->get();
---
select `reminders`.*, `users`.`nameEn`, `users`.`nameBn` from `reminders` inner join `users` on `users`.`id` = `reminders`.`user_id` where `if_notified` = 1 and `user_id` = 1 order by `created_at` desc