app/Http/Helpers/Setting.php

    public static function Settings()
    {
        return  Settings::first();
---
select * from `settings` limit 1

    public static function get_all_user()
    {
        return User::all();
---
select * from `users`