app/Http/Controllers/DashboardController.php

select * from `settings` limit 1
select count(*) as aggregate from `documents`
select count(*) as aggregate from `categories`
select count(*) as aggregate from `users`
select * from `documents`
---
    public function user_dashboard($id = null)
    {

        $user = Auth::user();
        $user_dept_id = Auth::user()->department_id;
        $setting=Settings::first();
        // if ($user->hasRole('admin') || $user->hasRole('Admin')) {
        if ($user->emp_type == 'superadmin') {

            $user_id = Auth::user()->id;
            $user_name = Auth::user()->nameEn;
            $totalFiles = Document::count();
            $totalFolders = Category::count();
            $totalUser=User::count();
            // $officalRecentFolders = Category::where('id', '!=', 1)->where(['folder_type' => 'official', 'parent_category_id' => 1])->latest()->get();

            // $vipRecentFolders = Category::where('id', '!=', 1)->where(['folder_type' => 'vip_official', 'parent_category_id' => 1])->latest()->take(8)->get();

            $officalRecentFolders = Department::with('categories')->where('status', 1)->get();

            $vipRecentFolders = Category::where('id', '!=', 1)->where(['folder_type' => 'vip_official', 'parent_category_id' => 1])->latest()->get();

            $fileData = Document::latest()
                ->take(12)
                ->get();

select count(*) as aggregate from `documents`
select count(*) as aggregate from `categories`
select count(*) as aggregate from `users`
select * from `categories` where `id` != 1 and (`parent_category_id` = 1 and `folder_type` = 'official' and `department_id` = '3') order by `created_at` desc limit 8
---
        }elseif ($user->emp_type == 'sochebaloy_official') {
                $user_id = Auth::user()->id;
                $user_name = Auth::user()->nameEn;
                $totalFiles = Document::count();
                $totalFolders = Category::count();
                $totalUser=User::count();
                $officalRecentFolders = Category::where('id', '!=', 1)
                ->where(['parent_category_id' => 1, 'folder_type' => 'official', 'department_id' => $user_dept_id])->latest()->take(8)->get();

select * from `documents`
---
                $fileData = Document::where('department_id', $user_dept_id)->where('status', 'official')->latest()
                    ->take(12)
                    ->get();
                $documents = Document::get();

select count(*) as aggregate from `documents`
select count(*) as aggregate from `categories`
select count(*) as aggregate from `users`
select * from `categories` where `id` != 1 and (`folder_type` = 'vip_official' and `parent_category_id` = 1) order by `created_at` desc limit 8
select * from `documents`
---
        }elseif ($user->emp_type == 'vip_official') {
                $user_id = Auth::user()->id;
                $user_name = Auth::user()->nameEn;
                $totalFiles = Document::count();
                $totalFolders = Category::count();
                $totalUser=User::count();
                $officalRecentFolders = [];
                $vipRecentFolders = Category::where('id', '!=', 1)->where(['folder_type' => 'vip_official', 'parent_category_id' => 1])->latest()->take(8)->get();
                $fileData = Document::where('department_id', $user_dept_id)->where('status', 'vip_official')->latest()
                    ->take(12)
                    ->get();
                $documents = Document::get();