app/Http/Controllers/FileController.php

        if($searchData !=''){
            $data['parantcat']= 'back';
        }else{
            $data['parantcat'] = $category->where('id', $selectedCategoryId)->first()?$category->where('id', $selectedCategoryId)->first()->parent_category_id: '';
---
select * from `categories` where `id` = '1' limit 1