app/Http/Controllers/HomeController.php

    public function getuserlist()
    {
        // if (!Auth::user()->can('view_user_list')) {
        //     return redirect()->route('index');
        // }
        $users = User::all();
---
select * from `users`