app/Http/Controllers/ProfileController.php

    public function profile_details($id=null)
    {
        if ($id == null) {
            $data['user'] = Auth::user();
        }else{
            if (!Auth::user()->can('view_user_list')) {
                return redirect()->route('index');
            }else{
                $data['user'] = User::find($id);
            }
        }

        $data['roles'] = Role::latest()->get();

        $data['official_roles'] = OfficialRole::where('parent_id', 0)->get();
---
select * from `users` where `users`.`id` = '2' limit 1
select * from `roles` order by `created_at` desc
select * from `official_roles` where `parent_id` = 0

    public function update_user_profile(Request $request){
        $role = '';
        $dept_id = '';
        $dept_name = '';
        $office_role = '';

        // emp type: 5 shocibly, 4 vip
        if($request->sochebaloy_dept !== 0 && $request->emp_type !== 0 && $request->official_role !== 0 && $request->vip_user_type !== 0){
            if($request->emp_type == 5){
                $dept_id = $request->sochebaloy_dept;
                $office_role = $request->official_role;

                $dept_name = $request->sochebaloy_dept_role;
                $emp_type = 'sochebaloy_official';
                $role = Role::where('slug', 'secretariat_official')->first();
            }else{

                $dept_id = null;

                if($request->emp_type == 4){

                    $emp_type = 'vip_official';
                    $role = Role::where('slug', 'vip_official')->first();
---
select * from `roles` where `slug` = 'vip_official' limit 1

            }


            User::where('id', $request->user_id)->update([
                'emp_type' => $emp_type,
                'office_role' => $office_role?? '',
                'department_id' => $dept_id,
                'dept_role' => $dept_name,
            ]);


            $user = User::find($request->user_id);
---
update `users` set `emp_type` = 'vip_official', `office_role` = '3', `department_id` = '', `dept_role` = '', `users`.`updated_at` = '2024-06-02 12:08:55' where `id` = '23'
select * from `users` where `users`.`id` = '23' limit 1

    public function get_officals_roles(Request $request){
        $official_roles = OfficialRole::where('parent_id', $request->id)->get();
---
select * from `official_roles` where `parent_id` = '1'

    public function get_officals_depts(Request $request){

        if($request->id == 5){
            $official_roles = Department::where('status', 1)->get();
        }else{
            $official_roles = VipUserType::where('status', 1)->get();
---
select * from `vip_user_types` where `status` = 1